app/controllers/api/v1/auth_controller.rb

   def login
      user = User.find_by(userName: params[:userName])
---
SELECT "users".* FROM "users" WHERE "users"."userName" = $1 LIMIT $2  [["userName", "alex"], ["LIMIT", 1]]