app/controllers/api/v1/comments_controller.rb

    def create
        comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["content", "ok"], ["created_at", "2020-04-11 02:55:34.931734"], ["updated_at", "2020-04-11 02:55:34.931734"]]