app/controllers/api/v1/comments_controller.rb

    def index
        comments = Post.all
---
SELECT "posts".* FROM "posts"