app/controllers/api/v1/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2020-04-12 17:37:27.021744"], ["updated_at", "2020-04-12 17:37:27.021744"], ["count", 1]]
---
    def create
        like = Like.create(like_params)

SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 9]]
---
    def destroy
        like = Like.find(params[:id])
        like.destroy