app/controllers/api/v1/posts_controller.rb

    def show
        post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        post = Post.create(post_params)
---
INSERT INTO "posts" ("user_id", "content", "user_caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        post = Post.find(params[:id])

        post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "user_caption" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["content", "this React has much power"], ["user_caption", "we will demoe it ^^^^^^^^^"], ["updated_at", "2020-04-12 13:18:56.445771"], ["id", 1]]