app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("userName", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["userName", "sd1"], ["password_digest", "$2a$12$.fd.dNnh.SaSfj5eWeGZR.lz1FDx7hb4VgRVM75C3RcADVPyaIV0e"], ["created_at", "2020-04-15 17:49:08.005664"], ["updated_at", "2020-04-15 17:49:08.005664"]]
---
    def create
        # make a user uses the username and password
        user = User.new(
            userName: params[:userName],
            password: params[:password],
          )

          if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "userName" = $2, "password_digest" = $3, "email" = $4, "imageUrl" = $5, "updated_at" = $6 WHERE "users"."id" = $7
---
    def update
        user = User.find(params[:id])

        user.update(user_params)